Revit 2027 API
ConceptualConstructionType.IsValidSurfaceSubcategoryForConstruction Method
 Indicates if this ConceptualConstructionType is appropriate for the input MassSurfaceData subcategory.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSurfaceSubcategoryForConstruction(
	ElementId massSurfaceSubcategoryId
)
Public Function IsValidSurfaceSubcategoryForConstruction (
	massSurfaceSubcategoryId As ElementId
) As Boolean
public:
bool IsValidSurfaceSubcategoryForConstruction(
	ElementId^ massSurfaceSubcategoryId
)
member IsValidSurfaceSubcategoryForConstruction :
        massSurfaceSubcategoryId : ElementId -> bool
Parameters
massSurfaceSubcategoryId ElementId
 The ElementId of a Mass subcategory of a MassSurfaceData.
Return Value
Boolean
 Returns true if appropriate for the input subcategory, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The input Element massSurfaceSubcategoryId is not a valid subcategory value for MassSurfaceData.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace